---
kind: property
id: P:Autodesk.Revit.DB.IntersectionResult.XYZPoint
source: html/c33b0518-e0f9-cf50-2d20-41f4e689ba1b.htm
---
# Autodesk.Revit.DB.IntersectionResult.XYZPoint Property

Point of intersection in local 3d coordinates.

## Syntax (C#)
```csharp
public XYZ XYZPoint { get; internal set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InvalidOperationException** - Thrown in the getter when this property has not been set by the method providing the result.